public class Main {
    public static void main(String[] args) {
        // Создание массива объектов Reader
        Reader[] readers = {
                new Reader("Петров В. В.", 12345, "Информатика", "01.01.1990", "+7-123-456-7890"),
                new Reader("Иванов И. И.", 54321, "Математика", "15.05.1985", "+7-987-654-3210")
        };

        // Создание объектов Book
        Book book1 = new Book("Приключения", "Автор 1");
        Book book2 = new Book("Словарь", "Автор 2");
        Book book3 = new Book("Энциклопедия", "Автор 3");

        // Демонстрация работы методов takeBook
        readers[0].takeBook(3); // Петров В. В. взял 3 книги
        readers[0].takeBook("Приключения", "Словарь", "Энциклопедия"); // Петров В. В. взял книги: Приключения, Словарь, Энциклопедия
        readers[0].takeBook(book1, book2, book3); // Петров В. В. взял книги: Приключения (Автор 1), Словарь (Автор 2), Энциклопедия (Автор 3)

        // Демонстрация работы методов returnBook
        readers[1].returnBook(2); // Иванов И. И. вернул 2 книги
        readers[1].returnBook("Приключения", "Словарь"); // Иванов И. И. вернул книги: Приключения, Словарь
        readers[1].returnBook(book1, book2); // Иванов И. И. вернул книги: Приключения (Автор 1), Словарь (Автор 2)
    }
}
